# Feature Construction

## What is Feature Construction?
Feature Construction is the process of **creating new features** from existing raw data to make machine learning models **learn patterns more effectively**.

Instead of using data as-is, we **transform, combine, or decompose features** to expose meaningful information that improves model performance.

---

## Why Feature Construction is Important
- Enhances **model accuracy**
- Helps capture **hidden relationships**
- Improves **interpretability**
- Reduces reliance on complex models

> Better features often matter more than better algorithms.

---

## Common Feature Construction Techniques
- **Feature Splitting** ‚Äì breaking one feature into multiple parts  
- **Feature Transformation** ‚Äì log, scaling, normalization  
- **Feature Encoding** ‚Äì label encoding, one-hot encoding  
- **Feature Interaction** ‚Äì combining two or more features  
- **Aggregation** ‚Äì mean, sum, count over groups  

---

## Example
- Date ‚Üí year, month, weekday  
- Full name ‚Üí first name, last name  
- Price ‚Üí log(price)  
- Height & Weight ‚Üí BMI  

---

## Takeaway
Feature Construction bridges the gap between **raw data** and **model intelligence**.  
Well-constructed features can outperform even the most advanced models.

## What is Tidy Data?
Tidy Data is a standard way of organizing datasets so they are **easy to clean, analyze, visualize, and use in machine learning**.

The concept was introduced by **:contentReference[oaicite:0]{index=0}**.

---

## Principles of Tidy Data
A dataset is considered *tidy* if it follows these three rules:

1. Each **variable** forms a **column**
2. Each **observation** forms a **row**
3. Each type of **observational unit** forms a **separate table**

---

## Messy Data Example
| Name | Math | Science |
|------|------|---------|
| A    | 80   | 90      |
| B    | 85   | 88      |

---

## Tidy Data Version
| Name | Subject | Score |
|------|---------|-------|
| A    | Math    | 80    |
| A    | Science | 90    |
| B    | Math    | 85    |
| B    | Science | 88    |

---

## Why Tidy Data is Important
- Simplifies **data cleaning**
- Improves **EDA and visualization**
- Makes **feature engineering** easier
- Works smoothly with **ML pipelines**

---

## Takeaway
Well-structured data leads to **better insights and better models**.  
Tidy data is the foundation of effective data science.

Titanic : SibSp|Parent [Family type]

In [52]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [53]:
df = pd.read_csv("train.csv" , usecols = ['Age','Pclass','SibSp','Parch','Survived'])

In [54]:
df.head()

   Survived  Pclass   Age  SibSp  Parch
0         0       3  22.0      1      0
1         1       1  38.0      1      0
2         1       3  26.0      0      0
3         1       1  35.0      1      0
4         0       3  35.0      0      0

In [55]:
df.isnull().sum()

Survived      0
Pclass        0
Age         177
SibSp         0
Parch         0
dtype: int64

In [56]:
df.dropna(inplace=True)

In [57]:
df.isnull().sum()

Survived    0
Pclass      0
Age         0
SibSp       0
Parch       0
dtype: int64

In [58]:
X = df.drop(columns='Survived')
y = df['Survived']

In [59]:
X.head()

   Pclass   Age  SibSp  Parch
0       3  22.0      1      0
1       1  38.0      1      0
2       3  26.0      0      0
3       1  35.0      1      0
4       3  35.0      0      0

In [60]:
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler

In [61]:
pipe = Pipeline([
    ('scaler', StandardScaler()),
    ('lr', LogisticRegression(max_iter=1000))
])

In [62]:
np.mean(cross_val_score(pipe, X, y, cv=5, scoring='accuracy'))

0.6862897665714567

0.6862897665714567 : without feature construction

## Applying feature construction

In [63]:
X['Family_size'] = X['SibSp'] + X['Parch'] + 1

In [64]:
X.head()

   Pclass   Age  SibSp  Parch  Family_size
0       3  22.0      1      0            2
1       1  38.0      1      0            2
2       3  26.0      0      0            1
3       1  35.0      1      0            2
4       3  35.0      0      0            1

In [65]:
def family_category(num: int) -> int:
    if num == 1:
        return 0      # alone
    if num <= 4:
        return 1      # small family
    return 2          # large family

In [68]:
family_category(6)

2

In [70]:
X['Family_type'] = X['Family_size'].apply(family_category)

In [72]:
X.head()

   Pclass   Age  SibSp  Parch  Family_size  Family_type
0       3  22.0      1      0            2            1
1       1  38.0      1      0            2            1
2       3  26.0      0      0            1            0
3       1  35.0      1      0            2            1
4       3  35.0      0      0            1            0

In [73]:
X = X.drop(columns=['SibSp', 'Parch', 'Family_size'])

In [74]:
X.head()

   Pclass   Age  Family_type
0       3  22.0            1
1       1  38.0            1
2       3  26.0            0
3       1  35.0            1
4       3  35.0            0

In [75]:
pipe = Pipeline([
    ('scaler', StandardScaler()),
    ('lr', LogisticRegression(max_iter=1000))
])

In [76]:
np.mean(cross_val_score(pipe, X, y, cv=5, scoring='accuracy'))

0.6988574805476213

0.6988574805476213    :

## Feature Spiliting

In [86]:
df = pd.read_csv('train.csv')

In [87]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [90]:
df['Title'] = df['Name'].str.split(', ', expand=True)[1].str.split('.', expand=True)[0]

In [91]:
df['Title']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: Title, Length: 891, dtype: object

In [94]:
df[['Title','Name']]

    Title                                               Name
0      Mr                            Braund, Mr. Owen Harris
1     Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    Miss                             Heikkinen, Miss. Laina
3     Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      Mr                           Allen, Mr. William Henry
..    ...                                                ...
886   Rev                              Montvila, Rev. Juozas
887  Miss                       Graham, Miss. Margaret Edith
888  Miss           Johnston, Miss. Catherine Helen "Carrie"
889    Mr                              Behr, Mr. Karl Howell
890    Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [96]:
df.groupby('Title')['Survived'].mean().sort_values(ascending=False)

Title
the Countess    1.000000
Mlle            1.000000
Sir             1.000000
Ms              1.000000
Lady            1.000000
Mme             1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Col             0.500000
Major           0.500000
Dr              0.428571
Mr              0.156673
Jonkheer        0.000000
Rev             0.000000
Don             0.000000
Capt            0.000000
Name: Survived, dtype: float64

In [98]:
df['Is_Married'] = 0
df.loc[df['Title'] == 'Mrs', 'Is_Married'] = 1

In [99]:
df['Is_Married']

0      0
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64

In [100]:
df.groupby('Is_Married')['Survived'].mean().sort_values(ascending=False)

Is_Married
1    0.792000
0    0.317232
Name: Survived, dtype: float64

In [104]:
y = df['Survived']

In [103]:
X.head()

   Pclass   Age  Family_type
0       3  22.0            1
1       1  38.0            1
2       3  26.0            0
3       1  35.0            1
4       3  35.0            0

In [105]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,Is_Married
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,0

In [106]:
X = pd.concat([X, df[['Is_Married', 'Title']]], axis=1)

In [107]:
X.head()

   Pclass   Age  Family_type  Is_Married Title
0     3.0  22.0          1.0           0    Mr
1     1.0  38.0          1.0           1   Mrs
2     3.0  26.0          0.0           0  Miss
3     1.0  35.0          1.0           1   Mrs
4     3.0  35.0          0.0           0    Mr

In [108]:
from sklearn.pipeline import Pipeline
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import cross_val_score
import numpy as np

In [109]:
numeric_features = ['Pclass', 'Age', 'Family_type', 'Is_Married']
categorical_features = ['Title']

In [110]:
preprocessor = ColumnTransformer(
    transformers=[
        ('num', Pipeline([
            ('imputer', SimpleImputer(strategy='median')),
            ('scaler', StandardScaler())
        ]), numeric_features),

        ('cat', OneHotEncoder(handle_unknown='ignore'), categorical_features)
    ]
)

In [111]:
pipe = Pipeline([
    ('preprocess', preprocessor),
    ('model', LogisticRegression(max_iter=1000))
])

In [112]:
cv_scores = cross_val_score(
    pipe,
    X,
    y,
    cv=5,
    scoring='accuracy'
)

In [113]:
print("CV scores:", cv_scores)
print("Mean CV accuracy:", cv_scores.mean())
print("Std deviation   :", cv_scores.std())

CV scores: [0.59217877 0.61797753 0.61797753 0.61797753 0.61235955]
Mean CV accuracy: 0.6116941811562363
Std deviation   : 0.009997352629974653

In [115]:
y.value_counts(normalize=True)

Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [114]:
cross_val_score(pipe, X, y, cv=5, scoring='f1').mean()

0.005333333333333334

## F1 score is less because of class imbalance in Survived column : we can fix it using class_weight'balanced'

In [116]:
cross_val_score(pipe, X, y, cv=5, scoring='roc_auc').mean()

0.4996286920686249

üëâ This is basically random guessing

In [118]:
X['Title'].value_counts()

Title
Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Mlle              2
Major             2
Col               2
the Countess      1
Capt              1
Ms                1
Sir               1
Lady              1
Mme               1
Don               1
Jonkheer          1
Name: count, dtype: int64

fix using : df['Title'] = df['Title'].replace(
    ['Lady','Countess','Capt','Col','Don','Dr','Major','Rev','Sir','Jonkheer','Dona'],
    'Rare'
)

 or

2Ô∏è‚É£ Is_Married + Title = redundancy
3Ô∏è‚É£ Logistic Regression probabilities are poorly calibrated